#*********************************************************************************************************
#
#                                 北京翼辉信息技术有限公司
#
#                                   微型安全实时操作系统
#
#                                       MS-RTOS(TM)
#
#                               Copyright All Rights Reserved
#
#--------------文件信息--------------------------------------------------------------------------------
#
# 文   件   名: jerryscript.mk
#
# 创   建   人: IoT Studio
#
# 文件创建日期: 2020 年 10 月 12 日
#
# 描        述: 本文件由 IoT Studio 生成，用于配置 Makefile 功能，请勿手动修改
#*********************************************************************************************************

#*********************************************************************************************************
# Clear setting
#*********************************************************************************************************
include $(CLEAR_VARS_MK)

#*********************************************************************************************************
# Target
#*********************************************************************************************************
LOCAL_TARGET_NAME := jerryscript

#*********************************************************************************************************
# Source list
#*********************************************************************************************************
LOCAL_SRCS :=  \
src/jerryscript/jerry-main/main-unix.c \
src/jerryscript/jerry-main/main-utils.c \
src/jerryscript/jerry-main/main-options.c \
src/jerryscript/jerry-main/cli.c

#*********************************************************************************************************
# Header file search path (eg. LOCAL_INC_PATH := -I"Your header files search path")
#*********************************************************************************************************
LOCAL_INC_PATH := \
-I"./src/jerryscript/jerry-core/include" \
-I"./src/jerryscript/jerry-libm/include" \
-I"./src/jerryscript/jerry-ext/include" \
-I"./src/jerryscript/jerry-port/default/include"

#*********************************************************************************************************
# Pre-defined macro (eg. -DYOUR_MARCO=1)
#*********************************************************************************************************
LOCAL_DSYMBOL := \
-DJERRY_COMMIT_HASH="\" (2a8f1dc)\"" -DJERRY_CPOINTER_32_BIT=0 -DJERRY_DEBUGGER=0  \
-DJERRY_ERROR_MESSAGES=0 -DJERRY_EXTERNAL_CONTEXT=0 -DJERRY_GC_LIMIT="(0)"  \
-DJERRY_GC_MARK_LIMIT="(8)" -DJERRY_GLOBAL_HEAP_SIZE="(128)" -DJERRY_LINE_INFO=0  \
-DJERRY_LOGGING=0 -DJERRY_MEM_GC_BEFORE_EACH_ALLOC=0 -DJERRY_MEM_STATS=0 -DJERRY_NDEBUG  \
-DJERRY_PARSER=1 -DJERRY_PARSER_DUMP_BYTE_CODE=0 -DJERRY_REGEXP_DUMP_BYTE_CODE=0  \
-DJERRY_REGEXP_STRICT_MODE=0 -DJERRY_SNAPSHOT_EXEC=0 -DJERRY_SNAPSHOT_SAVE=0  \
-DJERRY_STACK_LIMIT="(0)" -DJERRY_SYSTEM_ALLOCATOR=0 -DJERRY_VALGRIND=0  \
-DJERRY_VM_EXEC_STOP=0  \
-DNDEBUG

#*********************************************************************************************************
# Compiler flags
#*********************************************************************************************************
LOCAL_CFLAGS   := 
LOCAL_CXXFLAGS := 

#*********************************************************************************************************
# Depend library (eg. LOCAL_DEPEND_LIB := -la LOCAL_DEPEND_LIB_PATH := -L"Your library search path")
#*********************************************************************************************************
LOCAL_DEPEND_LIB      := -ljerry-ext -ljerry-port-default -ljerry-core -ljerry-libm
LOCAL_DEPEND_LIB_PATH := -L$(OUTDIR)

#*********************************************************************************************************
# C++ config
#*********************************************************************************************************
LOCAL_USE_CXX        := no
LOCAL_USE_CXX_EXCEPT := no

#*********************************************************************************************************
# Code coverage config
#*********************************************************************************************************
LOCAL_USE_GCOV := no

#*********************************************************************************************************
# Stack check config
#*********************************************************************************************************
LOCAL_USE_STACK_CHECK := no

#*********************************************************************************************************
# User link command
#*********************************************************************************************************
LOCAL_PRE_LINK_CMD   := 
LOCAL_POST_LINK_CMD  := 
LOCAL_PRE_STRIP_CMD  := 
LOCAL_POST_STRIP_CMD := 

#*********************************************************************************************************
# Depend target
#*********************************************************************************************************
LOCAL_DEPEND_TARGET := \
$(OUTDIR)/libjerry-ext.a \
$(OUTDIR)/libjerry-port-default.a \
$(OUTDIR)/libjerry-core.a \
$(OUTDIR)/libjerry-libm.a

include $(APPLICATION_MK)

#*********************************************************************************************************
# End
#*********************************************************************************************************
